# Полина хранит на компьютере картинки и видео, объёмы которых различны. Она хочет сохранить
# часть из них на Флэш-накопитель объем которого равен М, следующим образом:
# 1) Сначала она сохраняет самые маленькие видеозаписи до тех пор, пока они не займут не
# менее чем половину от общей памяти,
# 2) В оставшееся место Полина сохраняет как можно больше картинок, стремясь занять весь
# оставшийся объем
# Определите сначала, сколько свободного места останется на флэш носителе, затем общее
# количество элементов, которое в итоге удалось поместить. Запишите значения в ответ через
# пробел.

# Входные данные. В первой строке входного файла находятся два числа: N количество всех
# изображений и видео, М - объем флеш накопителя. N, М - натуральные числа, не превышающие
# 10 ^ 6. В следующих N строках находятся значения объемов картинок и видео соответственно,
# эти объемы указаны в КБайтах. Каждая картинка весит не более 90 Кбайт, видео - не менее 91
# Кбайт. Запишите в ответе два числа: сначала объём оставшегося свободного места, затем
# общее количество картинок и видео, которые могут быть сохранены.

# Пример входного файла:
# 8 150
# 20
# 101
# 15
# 400
# 5
# 900
# 10
# 9

# При таких исходных данных можно сохранить 4 картинки(20 + 15 + 5 + 9=49) и 1 видео объёмом
# 101 имеем: 150 - (49 + 101)=0;
# 4+1=5 - элементов максимум можно сохранить. Ответ для данного примера: 0 5

inf = open('26.txt')
l = [i for i in inf]
n, s = list(map(int, l[0].split()))
del l[0]
l = [int(i) for i in l]
video, img = [], []
for i in l:
    if i > 90:
        video.append(i)
    else:
        img.append(i)
video.sort()
img.sort()
s1 = 0
cnt = 0
for i in video:
    if s1 < s/2:
        s1 += i
        cnt += 1
    else:
        print(i)
        break
s = s-s1
for i in img:
    if s - i >= 0:
        cnt += 1
        s -= i
    else:
        print(i)
        break
print(set(img))
print(set(video))
print(s, cnt)

# Ответ: 18 7728
