# Файл 17.txt содержит последовательность неотрицательных целых чисел, не превышающих 10000.
# Назовём парой два идущих подряд элемента последовательности. Определите количество пар, в которых
# один из двух элементов делится на 7, а другой больше среднего арифметического всех
# нечетных элементов последовательности. В ответе запишите два числа: сначала количество найденных
# пар, а затем — минимальную сумму элементов таких пар.
# Например, в последовательности(1 7 6 8 14) есть две подходящих пары: (7 6) и(8 14), в ответе для этой последовательности надо записать числа 2 и 13.

with open('17.txt') as F:
    f = list(map(int, F.readlines()))
    odd = []
    for i in f:
        if i % 2 != 0:
            odd.append(i)

    oddAvrg = sum(odd) / len(odd)
    c, cMin = 0, 1000000000
    for i in range(len(f) - 1):
        if f[i] % 7 == 0 and f[i + 1] > oddAvrg or \
                f[i + 1] % 7 == 0 and f[i] > oddAvrg:
            c += 1
            cMin = min(cMin, f[i] + f[i + 1])

    print(c, cMin)

# Ответ: 1459 674
